Revit 2017 API
AssetProperty.GetAllConnectedProperties Method
 Gets the list of the connected properties. Connected properties are the detachable properties of an AssetProperty. e.g. diffuse property can have texture as its connected property. It can also detach texture on runtime.
Namespace: Autodesk.Revit.Utility
Assembly: RevitAPI (in RevitAPI.dll) Version: 17.0.0.0 (17.0.484.0)
Since: 2014
Syntax
C#
public IList<AssetProperty> GetAllConnectedProperties()
Visual Basic
Public Function GetAllConnectedProperties As IList(Of AssetProperty)
Visual C++
public:
IList<AssetProperty^>^ GetAllConnectedProperties()
Return Value
 A list of the connected properties.
See Also
AssetProperty Class
Autodesk.Revit.Utility Namespace